Revit 2027 API
ReinforcementSettings.GetFabricRoundingManager Method
 Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricRoundingManager GetFabricRoundingManager()
Public Function GetFabricRoundingManager As FabricRoundingManager
public:
FabricRoundingManager^ GetFabricRoundingManager()
member GetFabricRoundingManager : unit -> FabricRoundingManager
Return Value
FabricRoundingManager
 The rounding manager.
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace